---
type: UnifiedBitmap
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 13
tags: [revit-api, class]
---

# UnifiedBitmap

`Autodesk.Revit.DB.Visual.UnifiedBitmap` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | TextureLinkTextureTransforms | 2018 | `public static string TextureLinkTextureTransforms { get ; }` |
| Property | TextureOffsetLock | 2018 | `public static string TextureOffsetLock { get ; }` |
| Property | TextureRealWorldOffsetX | 2018 | `public static string TextureRealWorldOffsetX { get ; }` |
| Property | TextureRealWorldOffsetY | 2018 | `public static string TextureRealWorldOffsetY { get ; }` |
| Property | TextureRealWorldScaleX | 2018 | `public static string TextureRealWorldScaleX { get ; }` |
| Property | TextureRealWorldScaleY | 2018 | `public static string TextureRealWorldScaleY { get ; }` |
| Property | TextureScaleLock | 2018 | `public static string TextureScaleLock { get ; }` |
| Property | TextureURepeat | 2018 | `public static string TextureURepeat { get ; }` |
| Property | TextureVRepeat | 2018 | `public static string TextureVRepeat { get ; }` |
| Property | TextureWAngle | 2018 | `public static string TextureWAngle { get ; }` |
| Property | UnifiedbitmapBitmap | 2018 | `public static string UnifiedbitmapBitmap { get ; }` |
| Property | UnifiedbitmapInvert | 2018 | `public static string UnifiedbitmapInvert { get ; }` |
| Property | UnifiedbitmapRGBAmount | 2018 | `public static string UnifiedbitmapRGBAmount { get ; }` |